Catalogs/СтатьиЗатрат.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Catalog>
		<Properties>
			<Name>СтатьиЗатрат</Name>
			<Comment>(Общ)</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидЗатрат</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыЗатрат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусМатериальныхЗатрат</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыМатериальныхЗатратНаПроизводство</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХарактерЗатрат</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ХарактерЗатрат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидРасходовНУ</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыРасходовНУ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/ВидыЗатрат.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Enum>
		<Properties>
			<Name>ВидыЗатрат</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Материальные</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаТруда</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Амортизация</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочие</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ХарактерЗатрат.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Enum>
		<Properties>
			<Name>ХарактерЗатрат</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>БракВПроизводстве</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВложенияВоВнеоборотныеАктивы</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИздержкиОбращения</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КоммерческиеРасходы</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбщепроизводственныеРасходы</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбщехозяйственныеРасходы</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроизводственныеРасходы</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочие</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеУчитываемыеВУправленческомУчете</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаготовлениеИПриобретениеМЦ</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/СтатьиЗатрат/Forms/ФормаЭлементаУправляемая/Ext/Form/Module.bsl
// Процедура управляет доступностью ЭУ в форме
//
// Параметры
//  нет
//
&НаКлиенте
Процедура УправлениеДиалогом()
	
	Если Объект.ВидЗатрат = ПредопределенноеЗначение("Перечисление.ВидыЗатрат.Материальные") 
	   И Объект.ХарактерЗатрат = ПредопределенноеЗначение("Перечисление.ХарактерЗатрат.ПроизводственныеРасходы") Тогда
		Элементы.СтатусМатериальныхЗатрат.Доступность = Истина;
		Элементы.СтатусМатериальныхЗатрат.ОтметкаНезаполненного = Объект.СтатусМатериальныхЗатрат.Пустая();
	Иначе
		Элементы.СтатусМатериальныхЗатрат.Доступность = Ложь;
		Элементы.СтатусМатериальныхЗатрат.ОтметкаНезаполненного = Ложь;
	КонецЕсли;
	
КонецПроцедуры // УправлениеДиалогом()

// Процедура обработчик события "ПриИзменении" реквизита "ВидЗатрат".
// 

&НаКлиенте
Процедура ВидЗатратПриИзменении(Элемент)
	
	Если НЕ Объект.ВидЗатрат = ПредопределенноеЗначение("Перечисление.ВидыЗатрат.Материальные") Тогда
		Объект.СтатусМатериальныхЗатрат = Неопределено;
	КонецЕсли;
	
	УправлениеДиалогом();
	
КонецПроцедуры // ВидЗатратПриИзменении()

// Процедура обработчик события "ПриИзменении" реквизита "ХарактерЗатрат".
// 
&НаКлиенте
Процедура ХарактерЗатратПриИзменении(Элемент)
	
	Если Объект.ХарактерЗатрат <> ПредопределенноеЗначение("Перечисление.ХарактерЗатрат.ПроизводственныеРасходы") Тогда
		Объект.СтатусМатериальныхЗатрат = Неопределено;
	КонецЕсли;
	
	УправлениеДиалогом();
	
КонецПроцедуры // ХарактерЗатратПриИзменении()

// Процедура заполняет список значений для поля "Характер затрат".
//
&НаСервере
Процедура ЗаполнитьСписокХарактеровЗатрат()
	
	СписокВыбора = Элементы.ХарактерЗатрат.СписокВыбора;
	СписокВыбора.Очистить();
	
	Для Каждого Значение Из Перечисления.ХарактерЗатрат Цикл
		
		Если Значение = Перечисления.ХарактерЗатрат.ЗаготовлениеИПриобретениеМЦ Тогда
			Продолжить;
		КонецЕсли;
		
		СписокВыбора.Добавить(Значение);
	
	КонецЦикла;
	
КонецПроцедуры // ЗаполнитьСписокХарактеровЗатрат()

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

// Обработчик события ПриОткрытии Формы.
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ЗаполнитьСписокХарактеровЗатрат();
	
КонецПроцедуры // ПриОткрытии()

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УправлениеДиалогом();
КонецПроцедуры
